{
  "_name_or_path": "florence2",
  "architectures": [
    "Florence2ForConditionalGeneration"
  ],
  "auto_map": {
    "AutoConfig": "configuration_florence2.Florence2Config",
    "AutoModelForCausalLM": "modeling_florence2.Florence2ForConditionalGeneration"
  },
  "bos_token_id": 0,
  "eos_token_id": 2,
  "ignore_index": -100,
  "model_type": "florence2",
  "pad_token_id": 1,
  "projection_dim": 768,
  "text_config": {
      "vocab_size": 51289,
      "activation_dropout": 0.1,
      "activation_function": "gelu",
      "add_bias_logits": false,
      "add_final_layer_norm": false,
      "attention_dropout": 0.1,
      "bos_token_id": 0,
      "classif_dropout": 0.1,
      "classifier_dropout": 0.0,
      "d_model": 768,
      "decoder_attention_heads": 12,
      "decoder_ffn_dim": 3072,
      "decoder_layerdrop": 0.0,
      "decoder_layers": 6,
      "decoder_start_token_id": 2,
      "dropout": 0.1,
      "early_stopping": true,
      "encoder_attention_heads": 12,
      "encoder_ffn_dim": 3072,
      "encoder_layerdrop": 0.0,
      "encoder_layers": 6,
      "eos_token_id": 2,
      "forced_eos_token_id": 2,
      "forced_bos_token_id": 0,
      "gradient_checkpointing": false,
      "init_std": 0.02,
      "is_encoder_decoder": true,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1,
        "LABEL_2": 2
      },
      "max_position_embeddings": 1024,
      "no_repeat_ngram_size": 3,
      "normalize_before": false,
      "num_hidden_layers": 6,
      "pad_token_id": 1,
      "scale_embedding": false,
      "num_beams": 3
  },
  "vision_config": {
    "model_type": "davit",
    "drop_path_rate": 0.1,  
    "patch_size": [7, 3, 3, 3],  
    "patch_stride": [4, 2, 2, 2],  
    "patch_padding": [3, 1, 1, 1],  
    "patch_prenorm": [false, true, true, true],  
    "enable_checkpoint": false,  
    "dim_embed": [128, 256, 512, 1024],
    "num_heads": [4, 8, 16, 32],
    "num_groups": [4, 8, 16, 32],
    "depths": [1, 1, 9, 1],  
    "window_size": 12,
    "projection_dim": 768,
    "visual_temporal_embedding": {
        "type": "COSINE",
        "max_temporal_embeddings": 100
    },
    "image_pos_embed": {
        "type": "learned_abs_2d",
        "max_pos_embeddings": 50
    },
    "image_feature_source": ["spatial_avg_pool", "temporal_avg_pool"]
  },
  "vocab_size": 51289,
  "torch_dtype": "float32",
  "transformers_version": "4.41.0.dev0",
  "is_encoder_decoder": true
}